#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
# Documentation: https://getantidote.github.io/


# zsh-users/zsh-completions is a popular plugin for adding supplemental completions.
# We combine the `path:` and `kind:fpath` annotations here:
zsh-users/zsh-completions path:src kind:fpath


https://github.com/peterhurford/up.zsh
rummik/zsh-tailf
mattmc3/zman
agkozak/zsh-z


$ZDOTDIR/.aliases

# Setup prompt
romkatv/powerlevel10k 


# kind:path will put the plugin folder to $PATH, make sure that's how it should be installed
romkatv/zsh-bench kind:path # `zsh-bench` will benchmark shell script
ajeetdsouza/zoxide kind:path
junegunn/fzf kind:path
# Manually added tldr through brew, alternative to man

# Load the core plugins from the oh-my-zsh lib directory 
# TODO: Late go through and only load the ones I need
ohmyzsh/ohmyzsh path:lib

ohmyzsh/ohmyzsh path:plugins/copyfile # Adds `copyfile` to copy contents to clipboard 
ohmyzsh/ohmyzsh path:plugins/copypath # Adds `copypath` to copy path of dir or file to clipboard
ohmyzsh/ohmyzsh path:plugins/extract # Adds `extract` for extracting all archived/compressed files you pass it
ohmyzsh/ohmyzsh path:plugins/dotenv # Automatically load your project ENV variables from `.env` file when you `cd` into project root directory.
ohmyzsh/ohmyzsh path:plugins/magic-enter # Enter in a git dir with do a git status, otherwise an ls
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch # Automatically fetches remotes in the background. 


zdharma-continuum/fast-syntax-highlighting kind:defer

zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
